/*  
    冒泡排序: 从数组首位开始依次比较相邻两位元素，如果他们顺序错误则交换（升序或者降序）；
每次将一个较小的数字放在末尾（很类似拍集体照时按身高排序，相邻依次比较）；
核心在于双重嵌套循环，数据庞大时不适用。
    算法复杂度：O(N^2)
*/
#include<stdio.h>
int main()
{
	int  a[100], i, j, t, n;
	scanf_s("%d", &n);                  //输入一个数 n，表示接下来有 n 个数
	for (i = 1; i <= n; i++)            //循环读入 n 个数到数组a中 
		scanf_s("%d", &a[i]);

	//冒泡排序的核心 
	for (i = 1; i <= n - 1; i++)       // n 个数字只需比较 n-1 次
	{
		for (j = 1; j <= n - i; j++)   //从第 1 位开始比较直到最后一个尚未归位的数
		{
			if (a[j] < a[j + 1])       //比较大小并交换
			{
				t = a[j];
				a[j] = a[j + 1];
				a[j + 1] = t;
			}
		}
	}
	for (i = 1; i <= n; i++)           //输出
		printf("%d ", a[i]);

	printf("冒泡排序");
	getchar();
	getchar();
	return 0;
}
